

#+BEGIN_SRC emacs-lisp
(require 'button-lock)
(global-button-lock-mode)

(defvar ticket-regexp "\\([[:alpha:]]\\{2,5\\}-[[:digit:]]+\\)")

(button-lock-set-button 
 ticket-regexp
 (lambda ()
   (interactive)
   (save-excursion
     (goto-char (previous-single-property-change (point) 'button-lock))
     (looking-at ticket-regexp)
     (browse-url (format "http://www.some-ticket-system/%s" (match-string 0)))))
 :face 'org-link)
#+END_SRC

#+RESULTS:
| \([[:alpha:]]\{2,5\}-[[:digit:]]+\) | (0 (quote (face org-link keymap (keymap (mouse-1 lambda nil (interactive) (save-excursion (goto-char (previous-single-property-change (point) (quote button-lock))) (looking-at ticket-regexp) (browse-url (format [[http://www.some-ticket-system/%s]] (match-string 0)))))) button-lock t mouse-face button-lock-mouse-face rear-nonsticky t)) append) |

   TEST-123   
(re-search-backward ticket-regexp)q
